### For the following code, which of the following statements will not return `True`?

In [1]:
import pandas as pd

In [2]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [3]:
obj1 = pd.Series(sdata)
obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [4]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
states

['California', 'Ohio', 'Oregon', 'Texas']

In [5]:
obj2 = pd.Series(sdata, index=states)
obj2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [6]:
obj3 = pd.isnull(obj2)
obj3

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

> - `obj3['California']`
> - **`obj2['California'] == None`**
> - `import math; math.isnan(obj2['California'])`
> - `x = obj2['California']; obj2['California'] != x`

In [7]:
obj2['California'] == None

False

### In the following python code, the keys of the dictionary d represent student ranks and the value for each key is a student name. Which of the following can be used to extract rows with student ranks that are lower than or equal to 3?

In [8]:
import pandas as pd

In [9]:
d = {'1': 'Alice','2': 'Bob','3': 'Rita','4': 'Molly','5': 'Ryan'}
S = pd.Series(d)
S

1    Alice
2      Bob
3     Rita
4    Molly
5     Ryan
dtype: object

> - `S.loc[0:2]`
> - `S.iloc[0:2]`
> - **`S.iloc[0:3]`**
> - `S.loc[0:3]`

In [10]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

### Suppose we have a DataFrame named `df`. We want to change the original DataFrame df in a way that all the column names are cast to upper case. Which of the following expressions is incorrect to perform the same?

> - `df = df.rename(mapper = lambda x: x.upper(), axis = 'columns')`
> - `df = df.rename(mapper = lambda x: x.upper(), axis = 1)`
> - **`df.rename(mapper = lambda x: x.upper(), axis = 1)`**
> - `df.rename(mapper = lambda x: x.upper(), axis = 1, inplace = True)`

### For the given DataFrame df we want to keep only the records with a toefl score greater than 105. Which of the following will not work?

In [11]:
df = pd.DataFrame(
    data=[[337, 118],
         [324, 107],
         [316, 104],
         [322, 110],
         [314, 103]],
    index=list(range(1, 6)),
    columns=["gre score", 'toefl score']
)
df.index.name = "Serial No."
df

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

> - **`df.where(df['toefl score'] > 105)`**
> - `df.where(df['toefl score'] > 105).dropna()`
> - `df[df['toefl score'] > 105]`
> - `All of these will work`

In [12]:
df.where(df['toefl score'] > 105)

            gre score  toefl score
Serial No.
1               337.0        118.0
2               324.0        107.0
3                 NaN          NaN
4               322.0        110.0
5                 NaN          NaN

### Which of the following can be used to create a DataFrame in Pandas?

> - Pandas `Series` object
> - **All of these work**
> - Python `dict`
> - 2D `ndarray`

### Which of the following is an incorrect way to drop entries from the Pandas DataFrame named `df` shown below?

In [13]:
import numpy as np

In [14]:
df = pd.DataFrame(
    data=np.arange(16).astype(int).reshape(4, 4),
    index=["Ohio", "Colorado", "Utah", "New York"],
    columns=["one", "two", "three", "four"]
)
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

> - **`df.drop('two')`**
> - `df.drop(['Utah', 'Colorado'])`
> - `df.drop('one', axis = 1)`
> - `df.drop('Ohio')`

In [15]:
try:
    df.drop("two")
except KeyError as e:
    print(e)

"['two'] not found in axis"

### For the Series `s1` and `s2` defined below, which of the following statements will give an error?

In [16]:
import pandas as pd

In [17]:
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s1

1    Alice
2     Jack
3    Molly
dtype: object

In [18]:
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})
s2

Alice    1
Jack     2
Molly    3
dtype: int64

> - `s2.iloc[1]`
> - **`s2.loc[1]`**
> - `s1.loc[1]`
> - **`s2[1]`**

In [19]:
try:
    s2.loc[1]
except KeyError as e:
    print(e)

1

In [20]:
s2[1]

C:\Users\MOHEB_MAHER\AppData\Local\Temp\ipykernel_15104\2825080482.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[1]

2

### Which of the following statements is incorrect?

> - **`loc` and `iloc` are two useful and commonly used Pandas methods.**
> - If `s` and `s1` are two `pd.Series` objects, we cannot use `s.append(s1)` to directly append `s1` to the existing series `s`.
> - If `s` is a `pd.Series` object, then we can use `s.loc[<label>]` to get all data where the index is equal to `<label>`.
> - We can use `s.iteritems()` on a `pd.Series` object `s` to iterate on it.

### For the given DataFrame df shown below, we want to get all records with a toefl score greater than 105 but smaller than 115. Which of the following expressions is incorrect to perform the same?

In [21]:
df = pd.DataFrame(
    data=[[337, 118],
         [324, 107],
         [316, 104],
         [322, 110],
         [314, 103]],
    index=list(range(1, 6)),
    columns=["gre score", 'toefl score']
)
df.index.name = "Serial No."
df

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

> - **`(df['toefl score'] > 105) & (df['toefl score'] < 115)`**
> - `df[df['toefl score'].gt(105) & df['toefl score'].lt(115)]`
> - `df[(df['toefl score'] > 105) & (df['toefl score'] < 115)]`
> - `df[(df['toefl score'].isin(range(106, 115)))]`

In [22]:
(df['toefl score'] > 105) & (df['toefl score'] < 115)

Serial No.
1    False
2     True
3    False
4     True
5    False
Name: toefl score, dtype: bool

### Which of the following is the correct way to extract all information related to the student named Alice from the DataFrame df given below:

In [23]:
df = pd.DataFrame(
    data=[["Alice", 20, "F"],
         ["Jack", 22, "M"]],
    index=["Mathematics", "Sociology"],
    columns=["NAme", "Age", "Gender"]
)
df.index.name = "(Major)"
df

              NAme  Age Gender
(Major)
Mathematics  Alice   20      F
Sociology     Jack   22      M

> - `df.iloc['Mathematics']`
> - `df['Alice']`
> - **`df.T['Mathematics']`**
> - `df['Mathematics']`

In [24]:
df.T['Mathematics']

NAme      Alice
Age          20
Gender        F
Name: Mathematics, dtype: object